kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
/* ============================================
navX MXP source code is placed under the MIT license
Copyright (c) 2015 Kauai Labs

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in
all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
THE SOFTWARE.
===============================================
*/
extern "C" {
#include "navx-mxp_hal.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "mpucontroller.h"
#include "stm32f4xx_hal.h"
}

#include "navx-mxp.h"
#include "version.h"
#include "revision.h"
#include <math.h>
#include "AHRSProtocol.h"
#include "IMURegisters.h"
#include "usb_serial.h"
#include "HardwareSerial.h"
#include "FlashStorage.h"
#include "ext_interrupts.h"

extern I2C_HandleTypeDef hi2c3; /* External I2C Interface */
extern I2C_HandleTypeDef hi2c2; /* Internal I2C Interface (to MPU, etc.) */
extern SPI_HandleTypeDef hspi1; /* External SPI Interface */

TIM_HandleTypeDef TimHandle; /* Internal Timer */
FlashStorageClass FlashStorage; /* Class managing persistent configuration data */

int prepare_i2c_receive_timeout_count = 0;
unsigned long prepare_i2c_receive_last_attempt_timestamp = 0;
bool i2c_rx_in_progress = false;
uint32_t last_i2c_rx_start_timestamp = 0;
int i2c_glitch_count = 0;
HAL_StatusTypeDef prepare_next_i2c_receive();

#define RXBUFFERSIZE 64
uint8_t i2c3_RxBuffer[RXBUFFERSIZE];
uint8_t spi1_RxBuffer[RXBUFFERSIZE];

#define MIN_SAMPLE_RATE_HZ 4
#define MAX_SAMPLE_RATE_HZ 60

#define UART_RX_PACKET_TIMEOUT_MS 	30 /* Max wait after start of packet */
#define MIN_UART_MESSAGE_LENGTH		STREAM_CMD_MESSAGE_LENGTH

uint8_t clip_sample_rate(uint8_t update_rate_hz)
{
	if ( update_rate_hz < MIN_SAMPLE_RATE_HZ ) {
		update_rate_hz = MIN_SAMPLE_RATE_HZ;
	}
	if ( update_rate_hz > MAX_SAMPLE_RATE_HZ ) {
		update_rate_hz = MAX_SAMPLE_RATE_HZ;
	}
	return update_rate_hz;
}

#define MAX_SAMPLE_PERIOD (1000 / MIN_SAMPLE_RATE_HZ)
#define MIN_SAMPLE_PERIOD (1000 / MAX_SAMPLE_RATE_HZ)

#define NUM_STREAMING_INTERFACES 2

char update_type[NUM_STREAMING_INTERFACES] = { MSGID_YPR_UPDATE, MSGID_YPR_UPDATE };
char update_buffer[NUM_STREAMING_INTERFACES][AHRS_PROTOCOL_MAX_MESSAGE_LENGTH * 3];	/* Buffer for outbound serial update messages. */
char inbound_data[AHRS_PROTOCOL_MAX_MESSAGE_LENGTH];			/* Buffer for inbound serial messages.  */
char response_buffer[NUM_STREAMING_INTERFACES][AHRS_PROTOCOL_MAX_MESSAGE_LENGTH * 2];  /* Buffer for building serial reponse. */

struct fusion_settings {
	float motion_detect_thresh_g;
	float yaw_change_detect_thresh_deg;
	float sealevel_pressure_millibars;
};

struct board_orientation_settings {
	uint8_t yaw_axis;
	bool yaw_axis_up;
};

/* nav10_cal_data is persisted to flash */
struct flash_cal_data {
	uint8_t									selfteststatus;
	struct mpu_selftest_calibration_data 	mpucaldata;
	struct mpu_dmp_calibration_data 		dmpcaldata;
	bool   									dmpcaldatavalid;
	struct mag_calibration_data				magcaldata;
	struct fusion_settings					fusiondata;
	struct board_orientation_settings		orientationdata;
};

const float default_motion_detect_thresh_g = 0.02f;
const float default_yaw_change_detect_thresh_deg = 0.05f;
const float default_sealevel_pressure_millibars = 1013.25f;

void init_fusion_settings(struct fusion_settings *settings) {
	settings->motion_detect_thresh_g = default_motion_detect_thresh_g;
	settings->yaw_change_detect_thresh_deg = default_yaw_change_detect_thresh_deg;
	settings->sealevel_pressure_millibars = default_sealevel_pressure_millibars;
}

struct mpu_dmp_calibration_interpolation_coefficients {
	float gyro_m[3];
	float gyro_b[3];
};

unique_id chipid;

/* Protocol Registers are externally visible via I2C and SPI protocols. */
/* NOTE:  Each structure member MUST match the definitions in           */
/* IMUProtocol_Registers.h                                              */

struct __attribute__ ((__packed__)) nav10_protocol_registers {
	/* Constants */
	uint8_t					identifier;
	uint8_t					hw_rev;
	uint8_t					fw_major;
	uint8_t					fw_minor;
	/* Read/Write registers */
	uint8_t					update_rate_hz;
	/* Read-only Registers */
	uint8_t					accel_fsr_g;
	uint16_t				gyro_fsr_dps;
	uint8_t					op_status;
	uint8_t					cal_status;
	uint8_t					selftest_status;
	uint16_t				capability_flags;
	/* Reserved */
	uint8_t					reserved[3];
	/* Processed Data */
	uint16_t				sensor_status;
	uint32_t				timestamp;
	s_short_hundred_float	yaw;
	s_short_hundred_float	pitch;
	s_short_hundred_float	roll;
	u_short_hundred_float	heading;
	u_short_hundred_float	fused_heading;
	s_1616_float			altitude;
	s_short_thousand_float	world_linear_accel[3];
	s_short_ratio_float 	quat[4];
	/* Raw Data */
	s_short_hundred_float	mpu_temp_c;
	int16_t 				gyro_raw[3];
	int16_t 				accel_raw[3];
	int16_t 				mag_raw[3];
	s_1616_float			barometric_pressure;
	s_short_hundred_float	pressure_sensor_temp_c;
	s_short_hundred_float 	yaw_offset;
	s_short_ratio_float 	quat_offset[4];
	/* Integrated Values */
	/* - Read/Write Registers */
	uint16_t				integration_control;
	/* - Read-only Registers */
	s_1616_float			velocity[3];
	s_1616_float			displacement[3];
} registers, shadow_registers;

/* Statistical Averages */

#define YAW_HISTORY_PERIOD_MS 2000
#define WORLD_ACCEL_NORM_HISTORY_PERIOD_MS 250
#define WORLD_ACCEL_NORM_HISTORY_SIZE WORLD_ACCEL_NORM_HISTORY_PERIOD_MS / MIN_SAMPLE_PERIOD
#define YAW_HISTORY_SIZE YAW_HISTORY_PERIOD_MS / MIN_SAMPLE_PERIOD
float world_accel_norm_history[WORLD_ACCEL_NORM_HISTORY_SIZE];
float yaw_history[YAW_HISTORY_SIZE];
int world_acceleration_history_index = 0;
int yaw_history_index = 0;
float world_acceleration_norm_current_avg = 0.0f;
float yaw_current_average = 0.0f;

#define DEFAULT_MPU_SAMPLE_PERIOD_MS (1000 / DEFAULT_MPU_HZ)

