kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
int current_yaw_history_size = YAW_HISTORY_PERIOD_MS
		/ DEFAULT_MPU_SAMPLE_PERIOD_MS;
int current_world_accel_norm_history_size = WORLD_ACCEL_NORM_HISTORY_PERIOD_MS
		/ DEFAULT_MPU_SAMPLE_PERIOD_MS;

void calculate_current_history_sizes()
{
	int sample_period_ms = 1000 / registers.update_rate_hz;
	current_yaw_history_size = YAW_HISTORY_PERIOD_MS / sample_period_ms;
	current_world_accel_norm_history_size = WORLD_ACCEL_NORM_HISTORY_PERIOD_MS / sample_period_ms;
}

/******************* TUNING VARIBLES ********************/

void init_history()
{
	for (int i = 0; i < WORLD_ACCEL_NORM_HISTORY_SIZE; i++) {
		world_accel_norm_history[i] = world_acceleration_norm_current_avg;
	}
	for (int i = 0; i < YAW_HISTORY_SIZE; i++) {
		yaw_history[i] = yaw_current_average;
	}
	calculate_current_history_sizes();
}

uint8_t *flashdata = 0;

static const uint8_t flash_fast = 0b10101010; /* Self-test Fail */
static const uint8_t flash_slow = 0b11111110; /* IMU Cal */
static const uint8_t flash_on = 0b11111111; /* Startup, Mag Cal */
static const uint8_t flash_off = 0b00000000;

volatile int8_t cal_led_cycle_index = 7;
volatile uint8_t cal_led_cycle = flash_on;
float last_gyro_bias_load_temperature = 0.0;

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	HAL_CAL_LED_On((cal_led_cycle & (1 << cal_led_cycle_index)) ? 1 : 0);
	cal_led_cycle_index--;
	if (cal_led_cycle_index < 0) {
		cal_led_cycle_index = 7;
	}
}

void calc_linear_temp_correction_coefficients(		struct mpu_dmp_calibration_data *first,
													struct mpu_dmp_calibration_data *second,
													struct mpu_dmp_calibration_interpolation_coefficients *result )
{
	float delta_temp = fabs(first->mpu_temp_c - second->mpu_temp_c);
	float offset_first, offset_second, delta_offset;
	for ( int i = 0; i < 3; i++ ) {
		offset_first = ((float)first->gyro_bias_q16[i]) / 65536.0f;
		offset_second = ((float)second->gyro_bias_q16[i]) / 65536.0f;
		delta_offset = fabs(offset_second - offset_first);
		result->gyro_m[i] = delta_offset / delta_temp;
		result->gyro_b[i] = offset_first - (first->mpu_temp_c * result->gyro_m[i]);
	}
}

void interpolate_temp_correction_offsets( 	struct mpu_dmp_calibration_interpolation_coefficients *input,
											float temp_c,
											struct mpu_dmp_calibration_data *output )
{
	output->mpu_temp_c = temp_c;
	for ( int i = 0; i < 3; i++ ) {
		float gyro_output_float 	= (temp_c * input->gyro_m[i]) + input->gyro_b[i];
		output->gyro_bias_q16[i] 	= (long)(gyro_output_float * 65536.0f);
	}
}

void update_yaw_orientation_register()
{
    uint16_t yaw_axis_info =
         (((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis * 2) +
         ((((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up) ? 0 : 1) +
         1;
    registers.capability_flags &= ~NAVX_CAPABILITY_FLAG_OMNIMOUNT_CONFIG_MASK;
    registers.capability_flags |= (yaw_axis_info << 2);
}

int sense_and_update_yaw_orientation() {
	uint8_t mpu_yaw_axis;
	bool yaw_axis_up;
	if ( !sense_current_mpu_yaw_orientation( &mpu_yaw_axis, &yaw_axis_up) ) {
		set_current_mpu_to_board_xform(mpu_yaw_axis, yaw_axis_up);
		((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis = mpu_yaw_axis;
		((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up = yaw_axis_up;
		return 0;
	}
	return -1;
}

uint8_t crc_lookup_table[256];

_EXTERN_ATTRIB void nav10_init()
{
	IMURegisters::buildCRCLookupTable(crc_lookup_table, sizeof(crc_lookup_table));

	registers.op_status		= NAVX_OP_STATUS_INITIALIZING;
	registers.hw_rev		= NAVX_MXP_HARDWARE_REV;
	registers.identifier	= NAVX_MODEL_NAVX_MXP;
	registers.fw_major		= NAVX_MXP_FIRMWARE_VERSION_MAJOR;
	registers.fw_minor		= NAVX_MXP_FIRMWARE_VERSION_MINOR;
	read_unique_id(&chipid);
	registers.capability_flags = NAVX_CAPABILITY_FLAG_OMNIMOUNT |
	        NAVX_CAPABILITY_FLAG_VEL_AND_DISP |
	        NAVX_CAPABILITY_FLAG_YAW_RESET;

	__TIM11_CLK_ENABLE();
	/* Set Interrupt Group Priority; this is a low-priority interrupt */
	HAL_NVIC_SetPriority((IRQn_Type)TIM1_TRG_COM_TIM11_IRQn, 6, 0);
	/* Enable the TIMx global Interrupt */
	HAL_NVIC_EnableIRQ((IRQn_Type)TIM1_TRG_COM_TIM11_IRQn);
	/* Initialize low-priority, 125ms timer */
	TimHandle.Instance = TIM11;
	/* Compute the prescaler value to have TIM3 counter clock equal to 10 KHz */
	uint32_t uwPrescalerValue = (uint32_t) ((SystemCoreClock /2) / 10000) - 1;
	/* Initialize TIM3 peripheral for 250ms Interrupt */
	TimHandle.Init.Period = 2500 - 1;
	TimHandle.Init.Prescaler = uwPrescalerValue;
	TimHandle.Init.ClockDivision = 0;
	TimHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
	HAL_TIM_Base_Init(&TimHandle);
	HAL_TIM_Base_Start_IT(&TimHandle); /* Enable timer interrupt */

	HAL_LED_Init();
	HAL_LED1_On(1);
	HAL_LED2_On(1);
	HAL_I2C_Power_Init();

	/* Ensure I2C is powered off, to handle case of a "soft" reset */
	HAL_I2C_Power_Off();
	HAL_Delay(50);

	if ( HAL_UART_Slave_Enabled() ) {
	  Serial6.begin(57600);
	}

	/* Power on the on-board I2C devices */
	HAL_I2C_Power_On();
	HAL_Delay(50);

	FlashStorage.init(sizeof(flash_cal_data));

	mpu_initialize(GPIO_PIN_8);
	enable_dmp();

	HAL_LED1_On(0);
	HAL_LED2_On(0);
	uint16_t flashdatasize;
	bool flashdatavalid;
	bool mpu_cal_complete = false;
	bool mag_cal_complete = false;
	registers.cal_status = NAVX_CAL_STATUS_IMU_CAL_INPROGRESS;
	registers.selftest_status = 0;
	flashdata = FlashStorage.get_mem(flashdatavalid,flashdatasize);
	if ( ( flashdatavalid ) &&
	   ( flashdatasize == sizeof(struct flash_cal_data) ) ) {
		if ( ((struct flash_cal_data *)flashdata)->dmpcaldatavalid ) {
			mpu_apply_calibration_data( &((struct flash_cal_data *)flashdata)->mpucaldata );
			mpu_apply_dmp_gyro_biases(&((struct flash_cal_data *)flashdata)->dmpcaldata);
			set_current_mpu_to_board_xform(((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis,
					((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up);
			update_yaw_orientation_register();
			last_gyro_bias_load_temperature = ((struct flash_cal_data *)flashdata)->dmpcaldata.mpu_temp_c;
			cal_led_cycle = flash_off;
			registers.op_status = NAVX_OP_STATUS_NORMAL;
			registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_ACCUMULATE;
			mpu_cal_complete = true;
		}
		if ( !is_mag_cal_data_default(&((struct flash_cal_data *)flashdata)->magcaldata) ) {
			mpu_apply_mag_cal_data(&((struct flash_cal_data *)flashdata)->magcaldata);
			registers.cal_status |= NAVX_CAL_STATUS_MAG_CAL_COMPLETE;
			mag_cal_complete = true;
		}
		registers.selftest_status = ((struct flash_cal_data *)flashdata)->selfteststatus;
	}

	/* If no MPU calibration data exists, detect yaw orientation, and run self tests which */
	/* will acquire MPU calibration data.  Note that the self-tests require correct yaw    */
	/* orientation in order to return correct results.                                     */

	if ( !mpu_cal_complete ) {
		cal_led_cycle = flash_slow;
		registers.op_status = NAVX_OP_STATUS_SELFTEST_IN_PROGRESS;
		uint8_t selftest_status = 0;
		while ( selftest_status != 7 ) {
			if ( !sense_and_update_yaw_orientation() ) {
				selftest_status = run_mpu_self_test(&((struct flash_cal_data *)flashdata)->mpucaldata,
													((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis,
													((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up);
				if ( selftest_status == 7 ) {
					/* Self-test passed */
		            set_current_mpu_to_board_xform(((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis,
		                    ((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up);
		            update_yaw_orientation_register();
					mpu_apply_calibration_data(&((struct flash_cal_data *)flashdata)->mpucaldata);
					/* Retrieve default magnetometer calibration data */
					mpu_get_mag_cal_data(&((struct flash_cal_data *)flashdata)->magcaldata);
					init_fusion_settings(&((struct flash_cal_data *)flashdata)->fusiondata);
					registers.selftest_status = selftest_status | NAVX_SELFTEST_STATUS_COMPLETE;
					((struct flash_cal_data *)flashdata)->selfteststatus = selftest_status;
					registers.op_status = NAVX_OP_STATUS_IMU_AUTOCAL_IN_PROGRESS;
					registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_INPROGRESS;
					cal_led_cycle = flash_slow;
				} else {
					/* Self-test failed, and we have no calibration data. */
					/* Indicate error, and continue retrying.             */
					cal_led_cycle = flash_fast;
					registers.op_status = NAVX_OP_STATUS_ERROR;
					registers.selftest_status = selftest_status;
					/* Re-detect MPU on I2C bus */
					HAL_LED2_On( mpu_detect() ? 1 : 0);
				}
			} else {
				/* Couldn't sense yaw orientation axis.  The board needs to be held still and */
				/* with one of the axes perpendicular to the earth.  Continue retrying...     */
			}
		}
	}

	/* Configure device and external communication interrupts */

	GPIO_InitTypeDef GPIO_InitStruct;

	/*Configure GPIO pin : PC8 (MPU) for rising-edge interrupts */
	GPIO_InitStruct.Pin = GPIO_PIN_8;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	/* Configure GPIO pin : PC9 (CAL Button) for dual-edge interrupts */
	GPIO_InitStruct.Pin = GPIO_PIN_9;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	/* EXTI interrupt initialization */
	HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4/*NVIC_PRIORITYGROUP_0*/);
	HAL_NVIC_SetPriority((IRQn_Type)EXTI9_5_IRQn, 5, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type)EXTI9_5_IRQn);

	/* Initiate Data Reception on slave SPI Interface, if it is enabled. */
	if ( HAL_SPI_Slave_Enabled() ) {
		HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, 3);
	}

	/* Initiate Data Reception on slave I2C Interface */
	prepare_next_i2c_receive();
}

struct mpu_data mpudata;
struct mpu_config mpuconfig;
unsigned long last_scan = 0;
bool calibration_active = false;
unsigned long cal_button_pressed_timestamp = 0;
unsigned long reset_imu_cal_buttonpress_period_ms = 5000;

#define BUTTON_DEBOUNCE_SAMPLES 10

static void cal_button_isr(void)
{
	/* If CAL button held down for sufficient duration, clear accel/gyro cal data */
	bool button_pressed = false;

	/* De-bounce the CAL button */

	int button_pressed_count = 0;
	for ( int i = 0; i < BUTTON_DEBOUNCE_SAMPLES; i++) {
		if ( HAL_CAL_Button_Pressed() ) {
			button_pressed_count++;
		}
	}
	if ( button_pressed_count > (BUTTON_DEBOUNCE_SAMPLES/2) ) {
		button_pressed = true;
	}

	if ( button_pressed ) {
		cal_button_pressed_timestamp = HAL_GetTick();
	} else {
		if ( (HAL_GetTick() - cal_button_pressed_timestamp) >= reset_imu_cal_buttonpress_period_ms) {
			HAL_CAL_LED_On(1);
			((struct flash_cal_data *)flashdata)->dmpcaldatavalid = false;
			FlashStorage.commit();
			HAL_CAL_LED_On(0);
		}
	}
}

int set_tuning_var( AHRS_DATA_ACTION action, AHRS_TUNING_VAR_ID tuning_var_id, float tuning_value, bool write )
{
	int status;
	if ( action == DATA_SET_TO_DEFAULT ) {
		if ( tuning_var_id == UNSPECIFIED ) {
			for ( int i = MIN_TUNING_VAR_ID; i <= MAX_TUNING_VAR_ID; i++ ) {
				status = set_tuning_var( action, (AHRS_TUNING_VAR_ID)i, 0.0f, false);
			}
		} else {
			struct fusion_settings default_fusion_settings;
			struct mag_calibration_data default_magcaldata;
			init_fusion_settings(&default_fusion_settings);

			switch ( tuning_var_id ) {
			case MOTION_THRESHOLD:
				status = set_tuning_var( DATA_SET, MOTION_THRESHOLD, default_fusion_settings.motion_detect_thresh_g, false);
				break;
			case YAW_STABLE_THRESHOLD:
				status = set_tuning_var( DATA_SET, YAW_STABLE_THRESHOLD, default_fusion_settings.yaw_change_detect_thresh_deg, false);
				break;
			case SEA_LEVEL_PRESSURE:
				status = set_tuning_var( DATA_SET, SEA_LEVEL_PRESSURE, default_fusion_settings.sealevel_pressure_millibars, false);
				break;
			case MAG_DISTURBANCE_THRESHOLD:
				get_default_mag_cal_data(&default_magcaldata);
				status = set_tuning_var( DATA_SET, MAG_DISTURBANCE_THRESHOLD, default_magcaldata.mag_disturbance_ratio, false);
				break;
			case UNSPECIFIED:
			default:
				status = DATA_GETSET_ERROR;
				break;
			}
		}
	} else if ( action == DATA_SET ) {
		switch ( tuning_var_id ) {
		case MOTION_THRESHOLD:
			(((struct flash_cal_data *)flashdata)->fusiondata).motion_detect_thresh_g = tuning_value;
			status = DATA_GETSET_SUCCESS;
			break;
		case YAW_STABLE_THRESHOLD:
			(((struct flash_cal_data *)flashdata)->fusiondata).yaw_change_detect_thresh_deg = tuning_value;
			status = DATA_GETSET_SUCCESS;
			break;
		case SEA_LEVEL_PRESSURE:
			(((struct flash_cal_data *)flashdata)->fusiondata).sealevel_pressure_millibars = tuning_value;
			status = DATA_GETSET_SUCCESS;
			break;
		case MAG_DISTURBANCE_THRESHOLD:
			(((struct flash_cal_data *)flashdata)->magcaldata).mag_disturbance_ratio = tuning_value;
			mpu_apply_mag_cal_data(&((struct flash_cal_data *)flashdata)->magcaldata);
			status = DATA_GETSET_SUCCESS;
			break;
		default:
			status = DATA_GETSET_ERROR;
			break;
		}
	} else {
		status = DATA_GETSET_ERROR; /* Get Response (not implemented on navX MXP) */
	}
	if ( write && ( status == DATA_GETSET_SUCCESS ) ) {
		status = (FlashStorage.commit() == HAL_OK) ? 0 : 1;
	}
	return status;
}

