kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
unsigned long start_timestamp = 0;	/* The time the "main" started. */
/* The time period (after the start timestamp) after which the yaw  */
/* offset calculation process will timeout.                         */
unsigned long yaw_offset_startup_timeout_ms = 20000;

/*****************************************
* MPU Calibration
*****************************************/

int yaw_offset_accumulator_count = 0;
float yaw_accumulator = 0.0;
float calibrated_yaw_offset = 0.0;
int imu_cal_bias_change_count = 0;
bool yaw_offset_calibration_complete = false;
unsigned long last_temp_compensation_check_timestamp = 0;

void update_config() {
	get_mpu_config(&mpuconfig);
	registers.accel_fsr_g = mpuconfig.accel_fsr;
	registers.gyro_fsr_dps = mpuconfig.gyro_fsr;
	registers.update_rate_hz = (uint8_t)mpuconfig.mpu_update_rate;
}

struct mpu_dmp_calibration_data curr_dmpcaldata;
struct mpu_dmp_calibration_data test_dmpcaldata;
struct mpu_dmp_calibration_interpolation_coefficients temp_correction_coefficients;
bool temp_correction_coefficients_valid = false;

PrintSerialReceiver* serial_interfaces[NUM_STREAMING_INTERFACES] = {&SerialUSB,&Serial6};
uint32_t last_packet_start_rx_timestamp[NUM_STREAMING_INTERFACES] = {0,0};
int num_serial_interfaces = 1;
/* Signal that sample rate has been updated by remote user */
bool sample_rate_update = true;
uint8_t new_sample_rate = 0;
/* Signal that integration control has been updated by remote user */
bool integration_control_update = true;
uint8_t new_integration_control = 0;

_EXTERN_ATTRIB void nav10_main()
{
	unsigned long timestamp;
	int uart_slave_enabled = HAL_UART_Slave_Enabled();
	if (uart_slave_enabled) {
		num_serial_interfaces++;
	}

	attachInterrupt(GPIO_PIN_9,&cal_button_isr,CHANGE);

	if ( start_timestamp == 0 ) {
		start_timestamp = HAL_GetTick();
	}

	while (1)
	{
	    bool send_stream_response[2] = { false, false };
	    bool send_mag_cal_response[2] = { false, false };
	    bool send_tuning_var_set_response[2] = { false, false };
	    bool send_data_retrieval_response[2] = {false, false};
	    bool send_integration_control_response[2] = {false,false};
	    uint8_t tuning_var_status;
	    AHRS_TUNING_VAR_ID tuning_var_id, retrieved_var_id;
	    AHRS_DATA_TYPE retrieved_data_type;
	    AHRS_DATA_ACTION data_action;
	    uint8_t integration_control_action;
	    int32_t integration_control_parameter;
		int num_update_bytes[2] = { 0, 0 };
		int num_resp_bytes[2] = { 0, 0 };
		periodic_compass_update();
		if ( sample_rate_update ) {
			if ( new_sample_rate != 0 ) {
				mpu_set_new_sample_rate(new_sample_rate);
				new_sample_rate = 0;
			}
			update_config();
			init_history();
			sample_rate_update = false;
			send_stream_response[0] = true;
			send_stream_response[1] = true;
		}
		if ( integration_control_update ) {
			reset_velocity_and_dispacement_integrator(&mpudata,new_integration_control);
			if ( new_integration_control & 0x80 ) {
				if ( yaw_offset_calibration_complete ) {
				    /* Current yaw angle now becomes zero degrees */
					float curr_yaw_offset;
					get_yaw_offset(&curr_yaw_offset);
					calibrated_yaw_offset = mpudata.yaw + curr_yaw_offset;
					registers.yaw_offset = calibrated_yaw_offset;
					set_yaw_offset(calibrated_yaw_offset);
				}
			}
			integration_control_update = false;
		}
		if ( dmp_data_ready() ) {
			HAL_LED1_On(1);
			if ( get_dmp_data(&mpudata) == 0 ) {
				last_scan = HAL_GetTick();
				HAL_LED2_On(1);

				registers.yaw 		= IMURegisters::encodeSignedHundredthsFloat(mpudata.yaw);
				registers.pitch 	= IMURegisters::encodeSignedHundredthsFloat(mpudata.pitch);
				registers.roll 		= IMURegisters::encodeSignedHundredthsFloat(mpudata.roll);
				registers.heading	= IMURegisters::encodeUnsignedHundredthsFloat(mpudata.heading);
				registers.fused_heading = IMURegisters::encodeUnsignedHundredthsFloat(mpudata.fused_heading);
				registers.mpu_temp_c = IMURegisters::encodeSignedHundredthsFloat(mpudata.temp_c);
				registers.altitude = 0; 					/* Todo:  update from pressure sensor */
				registers.barometric_pressure = 0;			/* Todo:  update from pressure sensor */
				registers.pressure_sensor_temp_c = 0;		/* Todo:  update from pressure sensor */
				registers.timestamp = mpudata.timestamp;
				for ( int i = 0; i < 4; i++ ) {
					registers.quat[i] = IMURegisters::encodeRatioFloat(
											(float)(mpudata.quaternion[i] >> 16) / 16384.0f);
				}
				for ( int i = 0; i < 3; i++ ) {
					registers.world_linear_accel[i] = IMURegisters::encodeSignedThousandthsFloat(
														mpudata.world_linear_accel[i]);
					registers.mag_raw[i]			= mpudata.calibrated_compass[i];
					registers.accel_raw[i]			= mpudata.raw_accel[i];
					registers.gyro_raw[i]			= mpudata.raw_gyro[i];
					IMURegisters::encodeProtocol1616Float( mpudata.velocity[i], (char *)&registers.velocity[i]);
					IMURegisters::encodeProtocol1616Float( mpudata.displacement[i], (char *)&registers.displacement[i]);
				}

				/* Peform motion detection, a deviation from the norm of world linear accel (X and Y axes) */
				float world_linear_accel_norm = fabs( sqrt( fabs (mpudata.world_linear_accel[0]*mpudata.world_linear_accel[0]) +
						fabs (mpudata.world_linear_accel[1]*mpudata.world_linear_accel[1]) ) );
				world_accel_norm_history[world_acceleration_history_index] = world_linear_accel_norm;
	            world_acceleration_history_index = (world_acceleration_history_index + 1) % current_world_accel_norm_history_size;
	            float world_acceleration_history_sum = 0;
	            for ( int i = 0; i < current_world_accel_norm_history_size; i++ ) {
	              world_acceleration_history_sum += world_accel_norm_history[i];
	            }
	            world_acceleration_norm_current_avg = world_acceleration_history_sum / current_world_accel_norm_history_size;
	            if ( world_acceleration_norm_current_avg > (((struct flash_cal_data *)flashdata)->fusiondata).motion_detect_thresh_g ) {
	            	registers.sensor_status |= NAVX_SENSOR_STATUS_MOVING;
	            } else {
	            	registers.sensor_status &= ~NAVX_SENSOR_STATUS_MOVING;
	            }
	            if ( mpudata.fused_heading_valid ) {
	            	registers.sensor_status |= NAVX_SENSOR_STATUS_FUSED_HEADING_VALID;
	            } else {
	            	registers.sensor_status &= ~NAVX_SENSOR_STATUS_FUSED_HEADING_VALID;
	            }

