kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
	            /* Accumulate Yaw History */
	            yaw_history[yaw_history_index] = mpudata.yaw;
	            yaw_history_index = (yaw_history_index + 1) % current_yaw_history_size;
	            float yaw_history_sum = 0;
	            float yaw_history_min = 9999.0;
	            float yaw_history_max = -9999.0;
	            float yaw_delta;
	            float curr_yaw;
	            for ( int i = 0; i < current_yaw_history_size; i++ ) {
	            	curr_yaw = yaw_history[i];
	            	yaw_history_sum += curr_yaw;
	            	if ( curr_yaw < yaw_history_min ) yaw_history_min = curr_yaw;
	            	if ( curr_yaw > yaw_history_max ) yaw_history_max = curr_yaw;
	            }
	            yaw_delta = fabs( yaw_history_max - yaw_history_min );
	            bool yaw_stable = ( yaw_delta < (((struct flash_cal_data *)flashdata)->fusiondata).yaw_change_detect_thresh_deg );
	            if ( yaw_stable ) {
	            	registers.sensor_status |= NAVX_SENSOR_STATUS_YAW_STABLE;
	            } else {
	            	registers.sensor_status &= ~NAVX_SENSOR_STATUS_YAW_STABLE;
	            }
	            if ( mpudata.magnetic_anomaly_detected ) {
	            	registers.sensor_status |= NAVX_SENSOR_STATUS_MAG_DISTURBANCE;
#ifdef DEBUG_MAG_ANOMALY
	            	SerialUSB.println("MAG ANOMALY!\r\n");
#endif
	            } else {
	            	registers.sensor_status &= ~NAVX_SENSOR_STATUS_MAG_DISTURBANCE;
	            }

#ifdef DEBUG_MOTION_DETECTION
	            char motion_string_buffer[40];
            	sprintf(motion_string_buffer,"%s, Yaw:  %s\r\n",registers.motion_detected ? "Moving" : "Still", yaw_stable ? "Stable" : "Unstable");
	            SerialUSB.write(motion_string_buffer);
#endif

	            /* Send Streaming Updates */

	    		for ( int ifx = 0; ifx < num_serial_interfaces; ifx++ ) {

	    			if ( update_type[ifx] == MSGID_AHRSPOS_UPDATE ) {

	    				num_update_bytes[ifx] = AHRSProtocol::encodeAHRSPosUpdate( update_buffer[ifx],
								mpudata.yaw,
								mpudata.pitch,
								mpudata.roll,
								mpudata.heading,
								0.0, 							/* TODO:  Calc altitude    */
								mpudata.fused_heading,
								mpudata.world_linear_accel[0],
								mpudata.world_linear_accel[1],
								mpudata.world_linear_accel[2],
								mpudata.temp_c,
								mpudata.quaternion[0] >> 16,
								mpudata.quaternion[1] >> 16,
								mpudata.quaternion[2] >> 16,
								mpudata.quaternion[3] >> 16,
								mpudata.velocity[0],
								mpudata.velocity[1],
								mpudata.velocity[2],
								mpudata.displacement[0],
								mpudata.displacement[1],
								mpudata.displacement[2],
								registers.op_status,
								registers.sensor_status,
								registers.cal_status,
								registers.selftest_status);
	    			}
	    			else if ( update_type[ifx] == MSGID_AHRS_UPDATE ) {

						num_update_bytes[ifx] = AHRSProtocol::encodeAHRSUpdate( update_buffer[ifx],
													mpudata.yaw,
													mpudata.pitch,
													mpudata.roll,
													mpudata.heading,
													0.0, 							/* TODO:  Calc altitude    */
													mpudata.fused_heading,
													mpudata.world_linear_accel[0],
													mpudata.world_linear_accel[1],
													mpudata.world_linear_accel[2],
													mpudata.temp_c,
													mpudata.raw_compass[0],
													mpudata.raw_compass[1],
													mpudata.raw_compass[2],
													mpudata.calibrated_compass[0],
													mpudata.calibrated_compass[1],
													mpudata.calibrated_compass[2],
													mpudata.ratio_of_mag_field_norm,
													mpudata.mag_norm_scalar,
													mpudata.quaternion[0] >> 16,
													mpudata.quaternion[1] >> 16,
													mpudata.quaternion[2] >> 16,
													mpudata.quaternion[3] >> 16,
													0.0f, 							/* TODO: Calc Baro pressure */
													0.0f, 							/* TODO: Acquire Baro Temp  */
													registers.op_status,
													registers.sensor_status,
													registers.cal_status,
													registers.selftest_status);

					}
					else if ( update_type[ifx] == MSGID_QUATERNION_UPDATE ) {

						num_update_bytes[ifx] = IMUProtocol::encodeQuaternionUpdate( update_buffer[ifx],
													mpudata.quaternion[0] >> 16,
													mpudata.quaternion[1] >> 16,
													mpudata.quaternion[2] >> 16,
													mpudata.quaternion[3] >> 16,
													mpudata.raw_accel[0],
													mpudata.raw_accel[1],
													mpudata.raw_accel[2],
													mpudata.calibrated_compass[0],
													mpudata.calibrated_compass[1],
													mpudata.calibrated_compass[2],
													mpudata.temp_c );

					} else if ( update_type[ifx] == MSGID_GYRO_UPDATE ) {

						num_update_bytes[ifx] = IMUProtocol::encodeGyroUpdate( update_buffer[ifx],
													mpudata.raw_gyro[0],
													mpudata.raw_gyro[1],
													mpudata.raw_gyro[2],
													mpudata.raw_accel[0],
													mpudata.raw_accel[1],
													mpudata.raw_accel[2],
													mpudata.calibrated_compass[0],
													mpudata.calibrated_compass[1],
													mpudata.calibrated_compass[2],
													mpudata.temp_c );

					} else {

						num_update_bytes[ifx] = IMUProtocol::encodeYPRUpdate( update_buffer[ifx],
													mpudata.yaw,
													mpudata.pitch,
													mpudata.roll,
													mpudata.heading);
					}
	    		}

				if ( registers.op_status == NAVX_OP_STATUS_IMU_AUTOCAL_IN_PROGRESS ) {

					if ( mpu_did_dmp_gyro_biases_change(&((struct flash_cal_data *)flashdata)->dmpcaldata) ) {
						imu_cal_bias_change_count++;
					}

					if ( ( ( registers.sensor_status & NAVX_SENSOR_STATUS_MOVING ) == 0 ) &&
						 ( ( registers.sensor_status & NAVX_SENSOR_STATUS_YAW_STABLE ) ) &&
						 ( imu_cal_bias_change_count > 0 ) ) {

						/* Sensor is still, and DMP calibration constants have been accumulated */
						/* Store to flash memory and begin accumulating yaw offsets.            */

						registers.cal_status &= ~NAVX_CAL_STATUS_IMU_CAL_STATE_MASK;
						registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_ACCUMULATE;
						cal_led_cycle = flash_off;
						((struct flash_cal_data *)flashdata)->dmpcaldatavalid = true;
						FlashStorage.commit();
						registers.op_status = NAVX_OP_STATUS_NORMAL;
						start_timestamp = HAL_GetTick();
					}
				}

				if ( registers.op_status == NAVX_OP_STATUS_NORMAL ) {

					/* Accumulate yaw offset if not yet completely acquired. */

